Repository: DevelopCubeLab/TrollSIMSwitcher
Catalog: TrollSIMSwitcher/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: About
zh_hans: 关于

source: Alert
zh_hans: 提示

source: Cancel
zh_hans: 取消

source: Cellular Data
zh_hans: 蜂窝数据

source: Cellular Plan
zh_hans: 蜂窝数据卡

# CellularPlanCount
source: Cellular Plan Count: %d
zh_hans: 蜂窝数据卡: %d张

# CFBundleDisplayName
source: Troll SIM Switcher
zh_hans: 蜂窝切换器

source: Close
zh_hans: 关闭

source: Compatibility Switch Mode
zh_hans: 兼容性切换模式

# CriticalAlertMessage
source: Critical Alert Permission Notice Due to iOS system restrictions, System apps are limited when requesting Critical Alert permissions. When enabling Critical Alerts for the first time, please switch the app to 'User' registration in TrollStore, fully close the app, and then reopen it to complete the permission request. After authorization is granted, you may switch the app back to 'System' registration. The permission will be preserved by the system, and this process only needs to be completed once.
zh_hans: 重要通知权限说明 iOS 对 System App 申请重要通知权限存在限制。 请在首次启用时，在TrollStore 中将 App 切换为'User'状态，并且彻底关闭App再次打开App以完成权限请求，授权成功后可切换为'System'状态，权限将被系统保留，无需重复操作。

source: Disable All Notifications
zh_hans: 禁用全部通知

source: Disable This Group Notifications
zh_hans: 禁用本组通知

source: Emergency Only
zh_hans: 仅限紧急呼叫

source: Enable
zh_hans: 启用

# EnableCompatibilityModeMessage
source: If you cannot switch the cellular data normally, please turn on %@, otherwise do not turn on this switch.
zh_hans: 如果无法正常切换蜂窝数据，请打开%@，否则请不要打开这个开关

# ExitAfterQuickSwitching
source: Exit App After Quick Switching
zh_hans: 快捷切换后退出应用程序

source: Get Current Cellular Data Slot
zh_hans: 获取当前蜂窝数据卡槽

# GetCurrentNetworkType
source: Get Current Cellular Data Network Type
zh_hans: 获取当前蜂窝网络类型

source: Go to Notification Settings
zh_hans: 跳转到通知设置

source: Home Screen Quick Actions
zh_hans: 桌面图标快捷方式

source: Network Type
zh_hans: 网络类型

source: No Cellular Plan Found
zh_hans: 没找到蜂窝数据卡

source: No Cellular Plan Selected
zh_hans: 没有选择蜂窝数据卡

# NoNotificationEnabledMessage
source: No notification types have been enabled. Please select a type of notification and enable it before sending the notification.
zh_hans: 未开启任何通知类型，请选择一个类型的通知并且开启后再发送通知

source: No Service
zh_hans: 无服务

source: Notifications
zh_hans: 通知

# NotificationsFooterMessage
source: On iOS 16 and later, it is recommended to switch using Lock Screen Widgets for a better experience. On iOS 14, enabling Critical Alerts is strongly recommended to improve usability. Notification will be displayed in silent mode.
zh_hans: 建议iOS 16以下用户使用，iOS 16及更高版本系统建议使用锁屏小组件切换，iOS 14用户建议开启重要通知提升使用体验，通知将以静音模式显示

source: Notifications Permission Denied
zh_hans: 通知权限被拒绝

# NotificationsPermissionGoToSettings
source: Notification permissions have been turned off, please go to system settings to enable notification permissions.
zh_hans: 通知权限已被关闭，请到系统设置中开启通知权限

source: Options
zh_hans: 选项

source: Select Cellular Plan
zh_hans: 选择蜂窝数据卡

# SendNotificationMessage
source: Notification sent successfully, open the notification center to view
zh_hans: 发送通知成功，打开通知中心即可查看

source: Send Notifications
zh_hans: 发送通知

source: Shortcuts
zh_hans: 快捷切换

source: Show Alert When Turning Off Cellular Plan
zh_hans: 关闭蜂窝数据卡时提示

source: Show Operator Name
zh_hans: 显示运营商名称

source: Show Phone Number
zh_hans: 显示电话号码

# ShowSlotLabel
source: Show SIM Slot Label
zh_hans: 显示卡槽标签

# SlotNumber
source: Slot %d
zh_hans: 卡 %d

source: Switch Cellular Data to Slot 1
zh_hans: 切换蜂窝数据至卡1

source: Switch Cellular Data to Slot 2
zh_hans: 切换蜂窝数据至卡2

source: Switch Cellular Network Mode
zh_hans: 切换蜂窝网络模式

# SwitchCellularNetworkModeDescription
source: Automatically switches between the highest available cellular network modes, such as 4G and 5G, based on your SIM’s supported network capabilities.
zh_hans: 根据当前 SIM 卡支持的网络能力，在可用的最高网络模式之间自动切换，例如在 4G 与 5G之间切换。

source: Switch Data SIM
zh_hans: 切换数据卡槽

source: Switch Failed!
zh_hans: 切换失败！

# SwitchFromTo
source: Switch %@ to %@
zh_hans: 切换%@至%@

# SwitchNetworkTypeTo4G
source: Switch Cellular Data Network Type to 4G
zh_hans: 切换蜂窝网络至4G

# SwitchNetworkTypeTo5G
source: Switch Cellular Data Network Type to 5G
zh_hans: 切换蜂窝网络至5G

source: Switch to %@
zh_hans: 切换至%@

source: Toggle Cellular Data Slot Notifications
zh_hans: 切换数据卡槽通知

source: Toggle Network Type Notifications
zh_hans: 切换网络类型通知

source: Turn Off
zh_hans: 关闭

# TurnOffCellularPlan
source: Turn Off %@
zh_hans: 关闭%@

# TurnOffCellularPlanAlertMessage
source: Turn Off %@? This cellular plan will be unavailable. You can turn it back on at any time.
zh_hans: 确认关闭 %@？ 关闭后，此蜂窝数据套餐将无法用于通话、短信和蜂窝数据。你可以随时在设置中重新开启。

source: Turn On
zh_hans: 打开

# TurnOnCellularPlan
source: Turn On %@
zh_hans: 启用%@

source: Unknown
zh_hans: 未知

source: Unknown Carrier
zh_hans: 未知运营商

source: Use Critical Notifications
zh_hans: 使用重要通知

source: Version
zh_hans: 版本
